# Пользователь вводит время в минутах и расстояние 
# в километрах. Найдите скорость в м/c.

print('Введите время в минутах: ')
t = int(input())
