# Дано значение температуры в градусах Цельсия. 
# Вывести температуру  в градусах Фаренгейта.

print('Введите значение температуры в град Цельсия T: ')
t = int(input())

print(f'Темепратура в град Фаренгейта F = {9/5*t + 32}')
